[[{"page_content": "MOR Token Claim Live Now MOR Fair Launch (/fair-launch) About Morpheus (#) About MOR Token MOR Fair Launch MOR20 Platform Morpheus Router Whitepaper Protection Fund Ecosystem (/ecosystem) Resources (#) Blog Media Events Docs FAQs Desktop Client Fair Launch (/fair-launch) About Morpheus About (/about) MOR Token (/mor-token) MOR Fair Launch (/fair-launch) MOR20 Platform (/MOR20) Morpheus Router (https://github.com/MorpheusAIs/Docs/blob/main/!KEYDOCS README FIRST!/Compute Providers/Morpheus Lumerin Model.md) Whitepaper (/whitepaper) Protection Fund (https://github.com/MorpheusAIs/Docs/blob/main/!KEYDOCS README FIRST!/Protection Fund Details.md) Ecosystem Resources Blog (/blog) Media (/media) Events (/events) Docs (https://github.com/MorpheusAIs/Docs) FAQs (/faqs) Desktop Client (https://github.com/MorpheusAIs/moragents) About Morpheus What is Morpheus? Enabling a decentralized AI network Morpheus is designed to incentivize the first open-source peer-to-peer network of personal general-purpose AI (smart agents). The Morpheus network is powered by the MOR token, which rewards contributors who work together to build, maintain, and utilize the open-source decentralized AI infrastructure. Read the Morpheus Whitepaper here → (https://mor.org/whitepaper) Morpheus Router Architecture No single points of failure, private, blockchain-agnostic To achieve its vision of a decentralized AI ecosystem, the Morpheus Router builds on the Lumerin architecture (https://lumerin.io/) , which was originally designed for decentralized Bitcoin mining. By adopting key design principles and incorporating tested elements into its node structure, Morpheus ensures a secure, scalable, and efficient platform for powering smart agents. The core design principles that Morpheus inherits from Lumerin include: No single points of failure (SPOFs) to enhance network resilience and security Single software solution for both providers and users, simplifying maintenance and ensuring consistency Minimal on-chain transactions, optimizing for reads over writes to reduce costs and improve performance Blockchain and model agnostic design, allowing compatibility with EVM chains and various AI models Prompt and inference privacy to protect sensitive data and maintain user confidentiality Node security through the use of proxy, load balancer, VPN, or obfuscation methods By leveraging the Lumerin model, Morpheus lays the foundation for a decentralized, open-source AI ecosystem. The Morpheus Router is now live on Testnet on Arbitrum Sepolia, you can find the contract here (https://louper.dev/diamond/0x64bc398e0935df5a61375fb82d1115a8f5ac6deb?network=arbitrumSepolia#facets) and the Github repo here (https://github.com/Lumerin-protocol/Morpheus-Lumerin-Node/releases) . Learn more about the Morpheus Router → (https://github.com/MorpheusAIs/Docs/blob/main/!KEYDOCS%20README%20FIRST!/Compute%20Providers/Morpheus%20Lumerin%20Model.md) Morpheus Contributors Four contributor groups build, maintain, and use Morpheus Morpheus bundles the skills, resources, and passion of open-source coders, capital providers, compute providers, and a community of builders. Coders Providers: Register as a developer, contribute to the Morpheus codebase, Smart Agent tools and reference implementations I can contribute code → (https://github.com/MorpheusAIs/Docs/blob/main/Contributions/Code%20-%20Proof_Of_ContributionSnapshot4.md) Capital providers: Stake ETH (stETH) to provide liquidity and contribute yield to bootstrap open-source projects. I can contribute capital → (https://dashboard.mor.org/#/mainnet/capital) Compute providers: bid to process user AI queries, earning MOR if jobs are completed satisfactorily. I can contribute compute → (https://github.com/MorpheusAIs/Docs/blob/main/Contributions/Compute%20-%20Proof%20of%20Contribution.md) Community contributors: earn MOR prorated to transaction fees burned by their front-ends/tools using the Morpheus API. I can contribute community → (mor.org/ecosystem) Morpheus aligns incentives between these four groups through the MOR token. Learn more about the MOR token → (https://mor.org/mor-token) Why the world needs open-source decentralized AI The revolution will not be centralized Artificial Intelligence is rapidly advancing, but most of this progress is locked behind closed doors, controlled by a handful of tech giants. The result? Censored, centralized, fragile models that operate in walled gardens, with the most cutting-edge AI locked behind paywalls inaccessible to the majority of the world. Morpheus is founded on the belief that AI should be uncensored, permissionless, and fully aligned with the values of the open-source, decentralized community. MOR Token Claim Day on May 8th The Morpheus network is powered by the MOR token Staking Dashboard (https://dashboard.mor.org/#/mainnet/capital) Fair Launch (https://mor.org/fair-launch) Morpheus", "metadata": {"source": "https://mor.org/about"}}]]